package com.example.mente.Data.QuestionsSpecialist.FathyElZayat

import com.example.mente.Models.Question

class DataFathyElZayat {

    companion object{




    var fathyElZayatDataList1 = mutableListOf<Question>(
        Question(1," (1) يصعب عليه الاستمرار في أي عمل حتى يتمه" ,0),
        Question(2," (2) يبدو شارداً أو مشتتًا أو غير منتبه لما يسمع أو يقرأ أو يرى. " ,0),
        Question(3," (3)  يسهل تشتيته، يتشتت انتباهه بسهولة لأي مثيرات" ,0),
        Question(4," (4)  يجد صعوبة في أن يظل محتفظاً بانتباهه في المهام التي تتطلب تركيز الانتباه." ,0),
        Question(5," (5)  يجد صعوبة في التوقف عن أنشطة اللعب." ,0),
        Question(6," (6) يجد صعوبة في أن يظل هادئًا خلال الحصة أو الدرس أو الجلوس بصفة عامة." ,0),
        Question(7," (7)  يبدو متململاً أو عصبيًا خلال الأداء على المهام أو الأنشطة الأكاديمية  " ,0),
        Question(8," (8) يجد صعوبة في الاستغراق أو الانشغال بالعمل أو اللعب في هدوء.  " ,0),
        Question(9," (9) يتحدث كثيراً، وبصورة مفرطة، وبلا ضوابط أو هدف.  " ,0),
        Question(10," (10)  يتحول من نشاط إلى آخر قبل اكتمال النشاط الذي يبدأه. " ,0),
        Question(11," (11)  يجد صعوبة في متابعة الدروس أو التوجيهات التي تصدر عن المعلمين.  " ,0),
        Question(12," (12) يتشتت انتباهه لأي مثيرات خارج مواقف التعلم.  " ,0),
        Question(13," (13) يبدو مشوشاً تتداخل لديه المثيرات وتختلط عليه المعلومات.  " ,0),
        Question(14," (14) يقاطع أو يتطفل أو يقتحم الآخرين دون مبرر أو استئذان.  " ,0),
        Question(15," (15)   يجيب على الأسئلة باندفاع، وبلا تفكير، وقبل اكتمال سماعها. " ,0),
        Question(16," (16) يجد صعوبة في انتظار دوره في الألعاب أو المواقف " ,0),
        Question(17," (17)  يقحم نفسه بدنياً في أنشطة خطرة دون اعتبار لنتائجها. " ,0),
        Question(18," (18)  يجيب مندفعاً دون التأكد من معرفته الصحيحة للإجابات. " ,0),
        Question(19," (19)   يفقد أو ينسى أدواته اللازمة لأداء الأنشطة المدرسية أو المنزلية أو الرياضية.   " ,0),
        Question(20," (20)  يبدو مهملاً أو غير مهتم أو مكترث بما يكلف أو تكلف به من أنشطة أو مهام.  " ,0),


        )

    var fathyElZayatDataList2 = mutableListOf<Question>(
        Question(1," (1)  يجد صعوبات في الفهم الاستماعي للمعلومات التي تقدم شفهيا" ,0),
        Question(2," (2)  يجد صعوبة في فهم المناقشات أو الأسئلة التي توجه إليه. " ,0),
        Question(3," (3)   يجد صعوبة في فهم الكلمات المتماثلة نطقاً والمختلفة معنى." ,0),
        Question(4," (4)   يجد صعوبة في متابعة التعليمات أو الشرح الشفوي للمعلم" ,0),
        Question(5," (5)  يجد صعوبة في تمييز أصوات الحروف أو المقاطع المنطوقة." ,0),
        Question(6," (6)  يجد صعوبة في تهجي أصوات الحروف والمقاطع." ,0),
        Question(7," (7) يجد صعوبة في فهم واتباع التعليمات الشفهية واسترجاعها. " ,0),
        Question(8," (8) يجد صعوبة في إدراك الزمن: لحظة، بعد قليل، بعد ساعة  " ,0),
        Question(9," (9) يحتاج إلى تكرار الشرح الشفهي للمعلومات عدة مرات. " ,0),
        Question(10," (10)   يجد صعوبة في استيعاب معنى المعلومات شفهياً دون تكرار." ,0),
        Question(11," (11)  يفقد انتباهه للمدرس أو الدرس لأي مشتتات خارج الفصل.   " ,0),
        Question(12," (12)  يجد صعوبة في تتبع المثيرات والمعلومات السمعية.  " ,0),
        Question(13," (13)  يجد صعوبة في فهم معنى ومتابعة دلالات الأصوات والإشارات " ,0),
        Question(14," (14)  يجد صعوبة في متابعة شرح المعلم عند المعدل العادي للشرح  " ,0),
        Question(15," (15)  يجد صعوبة في فهم الشرح باستخدام التعبيرات العادية. " ,0),
        Question(16," (16) يجد صعوبة في إكمال مقاطع الكلمات الناقصة المسموعة. " ,0),
        Question(17," (17)   يجد صعوبة في إدراك تركيب الكلمات أو الحروف المسموعة. " ,0),
        Question(18," (18)  يصعب عليه إدراك معنى الكلمات المسموعة ناقصة حرف أو أكثر. " ,0),
        Question(19," (19)   يجد صعوبة في فهم معاني المقاطع المسموعة أو المنطوقة   " ,0),
        Question(20," (20)   يجد صعوبة في الفهم الاستماعي للمفاهيم الواردة.  " ,0),


        )

    var fathyElZayatDataList3 = mutableListOf<Question>(
        Question(1," (1)  يجد صعوبة في تمييز الرسوم والخرائط، أو الأشكال الهندسية" ,0),
        Question(2," (2)   يجد صعوبة في التمييز بين الحروف، والكلمات، والأعداد. " ,0),
        Question(3," (3)    يجد صعوبة في التمييز بين الأشياء من حيث اللون والحجم." ,0),
        Question(4," (4) يجد صعوبة في التمييز بين مكونات وتفاصيل الأشكال المرئية." ,0),
        Question(5," (5) يجد صعوبة في تمييز  الشكل  عن الخلفية المحيطة به الأرضية . " ,0),
        Question(6," (6) يجد صعوبة في إدراك الأشكال والرسوم البيانية بصرياً." ,0),
        Question(7," (7) يصعب عليه تجميع أجزاء الأشكال لتكوين الشكل أو الصورة. " ,0),
        Question(8," (8) يجد صعوبة في معرفة الشكل عندما ينقص منه جزء أو أكثر.  " ,0),
        Question(9," (9) يجد صعوبة في إكمال الفراغات بالكلمات أو الحروف أو الأعداد. " ,0),
        Question(10," (10)   يتوه أو يضيع أو يأخذ وقتاً في معرفة الأماكن المألوفة." ,0),
        Question(11," (11)  يجد صعوبة في التعرف على أشكال الحروف الهجائية أو الأعداد.  " ,0),
        Question(12," (12) يجد صعوبة في تمييز الأشكال الهندسية مثل المربع والمستطيل  " ,0),
        Question(13," (13)  يخطئ في كتابة بعض الرموز أو الكلمات مثل ٦ -٢ ،  عمل- علم." ,0),
        Question(14," (14)  يجد صعوبة في القراءة والكتابة والعمليات الحسابية والجداول. " ,0),
        Question(15," (15)   يجد صعوبة في إدراك الجزء بدون الكل أو الكل من أجزائه. " ,0),
        Question(16," (16) يجد صعوبة في الأجهزة والأدوات المعملية كالساعة، والترمومتر." ,0),
        Question(17,"  (17) يجد صعوبة في تذكر المعلومات المتتابعة مثل  ترتيب الحروف الأبجدية، شـهور السنة، أيام الأسبوع .   " ,0),
        Question(18," (18)   يجد صعوبة في استخدام النقط والفواصل في النصوص ." ,0),
        Question(19," (19)  يقرأ ببطء شديد أو يقرأ كلمة-كلمة، وبشكل متقطع.   " ,0),
        Question(20," (20)   يجد صعوبة في إدراك مدلول الحروف والكلمات عند القراءة الجهرية. " ,0),


        )
    var fathyElZayatDataList4 = mutableListOf<Question>(
        Question(1," (1)   يجد صعوبة في القيام بالأنشطة التي تتطلب التآزر بين أعضاء الجسم." ,0),
        Question(2," (2)   يجد صعوبة في التمييز بين اليمين واليسار، والشرق والغرب." ,0),
        Question(3," (3)    يجد صعوبة في مسك الأدوات، والكتابة على السطر." ,0),
        Question(4," (4)  تصدر عنه حركات عصبية تشخيصية عند الكتابة." ,0),
        Question(5," (5)   يجد صعوبة في إحداث تآزر بصري حركي إدراكي. " ,0),
        Question(6," (6) يجد صعوبة في التحدث والتعبير الحركي الشفهي." ,0),
        Question(7," (7) يفقد أماكن الكتابة والقراءة والعمليات الحسابية ورسم الأشكال. " ,0),
        Question(8," (8)  يجد صعوبة في ممارسة أنشطة الركل والمسك والرسم " ,0),
        Question(9," (9) يجد صعوبة في إدراك النشاط الحركي: اليمين واليسار، الدوران للخلف، ثني الجذع .. الخ. " ,0),
        Question(10," (10)  يجد صعوبة في ممارسة أنشطة الجري، والوثب، والركل، واستقبال الكرة." ,0),
        Question(11," (11)   يجد صعوبة في استخدام الأصابع في التآزر الحركي والأعمال الدقيقة." ,0),
        Question(12," (12)  يجد صعوبة في ممارسة الحركات الدقيقة مثل استخدام المقص. " ,0),
        Question(13," (13)   يصعب عليه ممارسة أي عمل يدوي أو بدني بدقة وسرعة." ,0),
        Question(14," (14)  يجد صعوبة في أداء مهارات مثل ارتداء الملابس، أو ركوب الدراجة. " ,0),
        Question(15," (15)  يجد صعوبة في مهارات الرسم والتلوين والأنشطة الرياضية. " ,0),
        Question(16," (16) يجد صعوبة في أداء المهارات الدقيقة مثل استخدام الأدوات الهندسية." ,0),
        Question(17," (17) يجد صعوبة في نطق الأعداد المركبة الأرقام، وتسمية الأشكال.  " ,0),
        Question(18," (18)  يمارس الأنشطة غير الهادفة، ويجد صعوبة في التوقف عنها." ,0),
        Question(19," (19)  يجد صعوبة في حمل الأشياء أو ركوب الدرجات أو اللعب الحركي. " ,0),
        Question(20," (20)  يجد صعوبة في التحكم الحركي مثل ربط الحذاء واستخدام الأدوات " ,0),


        )


   var fathyElZayatDataList5 = mutableListOf<Question>(
        Question(1," (1)  يجد صعوبة ملموسة في حفظ وتذكر أشكال الحروف والكلمات." ,0),
        Question(2," (2)   يعاني من تشتت واضطراب في تذكر المعلومات اللفظية." ,0),
        Question(3," (3)   سعة الاستيعاب أو الاحتفاظ لديه ضئيلة." ,0),
        Question(4," (4) يجد صعوبة في تذكر ما يسمع أو يقرأ." ,0),
        Question(5," (5)  يجد صعوبة في تذكر ما يشاهده أو يسمعه خلال فترات وجيزة. " ,0),
        Question(6," (6) يجد صعوبة في حفظ المعلومات والأشكال واسترجاعها ." ,0),
        Question(7," (7) يجد صعوبات في التحصيل الأكاديمي لمعظم المواد الدراسية. " ,0),
        Question(8," (8) يجد صعوبة في تذكر أو استرجاع ما يسمع أو يقرأ " ,0),
        Question(9," (9)  يجد صعوبة في الاحتفاظ بالمعلومات ومعالجتها ذهنياً. " ,0),
        Question(10," (10)   يجد صعوبة في استرجاع أو تذكر الرسوم والجداول والأماكن." ,0),
        Question(11," (11)   يجد صعوبة في استرجاع الأرقام والأعداد والمعلومات والقواعد." ,0),
        Question(12," (12)  يصعب عليه حفظ التعليمات التي يشاهدها أو يسمعها لمدة وجيزة. " ,0),
        Question(13," (13)   يجد صعوبة في تذكر ما يطلب منه من واجبات مدرسية. " ,0),
        Question(14," (14)   يجد صعوبات في تذكر الأحداث أو المواقف الحياتية واليومية. " ,0),
        Question(15," (15)   يجد صعوبة في حفظ تتابع أو ترتيب المعلومات أو المهارات. " ,0),
        Question(16," (16)  يفشل في تذكر الآليات والاستراتيجيات المناسبة للموقف المشكل." ,0),
        Question(17," (17) يجد صعوبات في تذكر النصوص أو القصائد الأكاديمية أو الدراسية.  " ,0),
        Question(18," (18)  يجد صعوبة في تذكر ترتيب الشهور أو تذكر جدول الضرب. " ,0),
        Question(19," (19)  يفشل في حفظ حقائق، أو قوانين، أو قواعد الرياضيات، وعلاقات. " ,0),
        Question(20," (20) يفشل في الاحتفاظ بما سبق تعلمه، وإعادة استخدامه، أو توظيفه. " ,0),


        )

    }
}